// 1) ხელით შეავსეთ 5-ელემენტიანი მთელი რიცხვების მასივი და გამობეჭდეთ მე-2 და მე-4 ინდექსზე მყოფი ელემენტები.
let number = [1, 2, 3, 4 ,5,6];
console.log(number[1], number[3]);


// 2) შემოგდით ჯერ N - შესატანი რიცხვების რაოდენობა, შემდეგ კი N ცალი რიცხვი. შეავსეთ მასივი (0 დან) შეყვანილი რიცხვებით და გამობეჭდეთ კენტ ინდექსზე მყოფი ელემენტები ( a[1], a[3], a[5]...)
let N= 5;
let a = new Array(N).fill(0);
for (let i = 0; i < N; i++) {
    a[i] = +prompt("შეიყვანეთ რიცხვი");
}

console.log(a[1], a[3], a[5]);



// 3) აღწერეთ 10 ელემენტიანი მთელი რიცხვების მასივი, შეიყვანეთ კონსოლიდან 10 ელემენტი (for-ით), მასივში არსებული რიცხვები გააორმაგეთ და გამობეჭდეთ ეკრანზე
let array = [1, 2, 3, 4, 5, 6, 7, 8, 9]
for (let i = 0; i < 10; i++) {
    array.push(Number(prompt("შეიყვანეთ რიცხვი")));
    array[i] *= 2
    console.log(array[i]);
}


// 4) შემოგდით ჯერ N - შესატანი რიცხვების რაოდენობა, შემდეგ კი N ცალი რიცხვი. შეინახეთ რიცხვები მასივში და გამობეჭდეთ შებრუნებული თანმიმდევრობით. (მაგ: თუ რიცხვებია 5 7 12, გამობეჭდეთ 12, 7, 5)

let N3 = prompt('Enter number: ');
const numbers = [];
for (let i = 0; i < N3; i++) {
    numbers.push(prompt(`Enter numbr ${i + 1}: `))
}

for (let i = N3-1;  i >= 0; i--) {
    console.log(numbers[i]);
}


console.log(typeof N3)




// 5) შემოგდით N, შემდეგ N ცალი რიცხვი. შეინახეთ მასივში, ადგილი გაუცვალეთ პირველ და ბოლო ელემენტს, და მასივი გამობეჭდეთ ეკრანზე.
let N1 = 5;
let a1 = new Array(N1).fill(0);
for (let i = 0; i < N1; i++) {
    a1[i] = +prompt("შეიყვანეთ რიცხვი");
}
console.log(a1[0], a1[N1-1]);
let temp = a[0];
a1[0] = a[N1-1];
a1[N1-1] = temp;
console.log(a1);
