// ახსენით რა განსხვაებაა ასოციაციურ მასივსა და ობიექტს შორის
// ასოციაციური მასივი - რომლის ინდექსიც წარმოდგენილია სტრინგით
// ობიექტი - გამოიყენება სტრინგ ინდექსზე


// შექმენით ასოციაციური მასივი და სცადეთ მასზე აქამდე ნასწავლი 3 მასივის მეთოდის გამოყენება
let x = [];
x["პირველი"] = "Giga"
x["მეორე"] = "Giga2"
x["მესამე"] = "Giga3"
console.log(x["პირველი"])
console.log(x["მეორე"])
console.log(x["მესამე"])



//  გამოიყენეთ ყველა შესწავლილი Math ობიექტის მეთოდი და გააკეთეთ თითო თითო მაგალითი
//abs - აბრუნებს ნომრის აბსოლუტური დადებითი ნაწილის
// იღებს 2 მნიშვნელობას, პირველი რიცხვი სიმძლავრეზე და მეორე სიმძლავრეზე, შემდეგ რიცხვს ანიჭებს გარკვეულ მნიშვნელობას
//ceil - ამრგვალებს ათწილადის ნომერს
//trunc - ამოიღებს მცურავ ნაწილს ნომრიდან
//round - მრგვალდება რიცხვი უახლოეს მთელ რიცხვამდე
//PI - აბრუნებს მათემატიკის პი მუდმივობას
//floor -  ამრგვალებს float რიცხვს მთელ რიცხვამდე
//sqrt - იღებს კვადრატულ ფესვს რიცხვიდან

console.log(Math.abs(-5.7));
console.log(Math.pow(6, 6));
console.log(Math.ceil(2.001));
console.log(Math.trunc(2.32322));
console.log(Math.round(4.242423));
console.log(Math.PI);
console.log(Math.floor(3.5));
console.log(Math.floor(Math.random() * 200));
console.log(Math.sqrt(20));



// 