#შექმენით ცვლადი რომელშიც შეინახავთ ნივთის ფასს. მეორე ცვლადში შეინახეთ ნივთის რაოდენობა.
#  თქვენი დავალებაა, რომ დაბეჭდოთ, თუ რამდენი უნდა გადაიხადოთ ნივთების ყიდვისას (ფასი * რაოდენობა)

price = 10
quantity = 5

print(price * quantity)


#შექმენით ცვლადი, სადაც შეინახავთ თქვენს ასაკს. შემდეგ შექმენით მეორე ცვლადი, სადაც შეინახავთ ნებისმიერი ოჯახისწევრის ასაკს. 
# თქვენი დავალებაა, რომ ჯერ დაბეჭდოთ თქვენს ასაკს + 10, შემდეგ ოჯახისწევრის ასაკს + 10.

me_age = 13
dad_age = 38

print(me_age + 10)
print(dad_age + 10)


#შექმენით ორი ცვლადი, თითოეულში შეინახეთ ნებისმიერი რიცხვი. თქვენი დავალებაა,
# რომ არითმეტიკული მოქმედებების შედეგი დაბეჭდოთ ამ რიცხვებს შორის - ეს მოქმედებებია +, -, *, /

num1 = 15
num2 = 5

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)



#შექმენით ორი ცვლადი, პირველში თქვენი სახელი, ხოლო მეორეში ასაკი შეინახეთ. თქვენი დავალებაა, რომ ჯერ სახელი დაბეჭდოთ, შემდეგ კი ასაკი.

nam = 'Giga'
age_of_Giga = 13

print(nam)
print(age_of_Giga)



#შექმენით ორი ცვლადი, პირველში შეინახეთ თქვენი ასაკი, ხოლო მეორეში შეინახეთ მშობლის ასაკი.
#  დაბეჭდეთ, თუ 10 წელში რამდენჯერ მეტი იქნება მშობლის ასაკი თქვენსაზე

me_age = 13
father_age = 38

print(father_age + 10 - me_age + 10)









