#გამოვიყენოთ ყველა კონვერტაციის ფუნქცია და გაავაკეთოთ თითოეულზე 5-5 მაგალითი


print(5 + 5)
#როცა ჩვენ integer-ს და integer-ს შევკრებთ ერთმანეთზე მივღებთ პასუხს მაგალითად 5 + 5=10
print(5 + "5")
#როცა ჩვენ integer-ს დავუმატებთ string-ს მივიღებთ ეროერს რადგან რიცხვს ტექსტზე ვერ შევკრებთ
print(5 + 5.5)
#ჩვენ შეგვიზლია მივუმატოთ ერთმანეთს integer-ი და float-ი ერთმანეთს 
print(5.5 + "5")
#ჩვენ ასევე არ შეგვიძლია შევკრიბოთ ერთად float-ი და string-ი 
print("5" + "5")
#ჩვენ როცა string-ს მივუმატებთ string-ს ეს ორი, სამი, ან რამდენიმე მონაცემი დაიწერება ერთად, მაგალითად "5" + "5"=55

print(5 - 5)
#როცა ჩვენ integer-ს და integer-ს გამოვაკლებთ ერთმანეთზე მივღებთ პასუხს მაგალითად 5 - 5=0
print(5 - 5.5)
#ჩვენ შეგვიზლია გამოვაკლოთ ერთმანეთზე integer-ი და float-ი 
print(5.5 - "5")
#ჩვენ ასევე არ შეგვიძლია გამოვაკლოთ ერთმანეთზე float-ი და string-ი 
print("5" - "5")
#ჩვენ როცა string-ს გამოვაკლებთ string-ს იქნება ერორი რადგან ტექსტს ტექსტს ვერ გამოვაკლებთ


print(5 * 5)
#როცა ჩვენ integer-ს და integer-ს გავამრავლებთ ერთმანეთზე მივღებთ პასუხს მაგალითად 5 * 5=25
print(5 * 5.5)
#ჩვენ შეგვიზლია გავამრავლოთ ერთმანეთზე integer-ი და float-ი 
print(5.5 * "5")
#ჩვენ ასევე არ შეგვიძლია გავამრავლოთ ერთმანეთზე float-ი და string-ი 
print("5" * "5")
#ჩვენ როცა string-ს გავამრავლებთ string-ზე ეს ორი, სამი, ან რამდენიმე მონაცემი დაიწერება ერთად, მაგალითად "5" * "5"=55
print(5 / 5)
#როცა ჩვენ integer-ს და integer-ს გავყობთ ერთმანეთზე მივღებთ პასუხს მაგალითად 5 / 5=1
print(5 / 5.5)
#ჩვენ შეგვიზლია გავყოთ ერთმანეთზე integer-ი და float-ი 
print(5.5 / "5")
#ჩვენ ასევე არ შეგვიძლია გავყოთ ერთმანეთზე float-ი და string-ი 
print("5" / "5")
#ჩვენ როცა string-ს გავყობთ string-ზე მივიგებთ ერორს რადგან მათემატიკაში ტექსტს ტექსტს ვერ გავყობთ





#5 რიცხვზე ყველა არითმეტიკული მოქმედება

num1 = float(input("please enter your first number: "))
num2 = float(input("please enter your second number: "))
num3 = float(input("please enter your third number: "))
num4 = float(input("please enter your fourth number: "))

print(num1 + num2 + num3 + num4)
print(num1 - num2 - num3 - num4)
print(num1 * num2 * num3 * num4)
print(num1 / num2 / num3 / num4)
print(num1 // num2 // num3 // num4)
print(num1 % num2 % num3 % num4) 


