# // შექმენი ფუნქცია რომელიც გადაცემული მასივიდან ამოიღებს ყველაზე
# //   გრძელ იმ ნაწილს სადაც რიცხვები ზრდის მიხედვითაა დალაგებული, 
# //   მაგ მასივში [1,2,3,1,2,3,4] ზრდის მიხედვით ყველაზე გრძელი ნაწილი 
# //   არის [1,2,3,4] ( მასივის ბოლო 4 ელემენტი). მეორე მაგ: [1,2,1,3,16,21,11], 
# //   ყველაზე გრძელი მასივის ნაწილი არის [16,21,11] რომელიც ზრდის მიხედვით იზდება. 


def func(arr):
  if not arr:
    return []
  
  arr1 =[]
  arr2 = [arr[0]]
  for i in range(1,len(arr)):
    if arr[i] > arr[i-1]:
      arr1.append(arr[i])
    else:
      if len(arr2) > len(arr1):
        arr1 = arr2
        arr2 = [arr[i]]
  if len(arr2) > len(arr1):
    arr1 = arr2
      
  return arr1

print(func([1,2,3,4,1,3,6]))