#შექმენით პითონის ფაილი და 4 ჯერ გამოიყენეთ print ფუნქცია,
#  პირველ პრინტში გამოიყენეთ ორ რიცხვს შორის შეკრება +, მეორეში - გამოკლება, მესამეში * გამრავლება, მეოთხეში / გაყოფა

print(5 + 10)
print(5 - 10)
print(5 * 10)
print(5 / 10)



#შეართეთ ორი ტექსტური მონაცემი და კომენტარებით ახსენით რა შედეგი მიიღეთ
print('Giga'  + ' ' + 'Kochalidze')
#მივიღე Giga KOchalidze


#დაუშვით ძალით შეცდომები და ნახეთ კომპიუტერი რას გამოგიტანთ შედეგად

print('Giga' + 5)
print(5 + 'Giga')


#ყველა დაწერილი კოდი ახსენით კომენტარები + (დოკუმენტში კომენტარების ამოყენებით ქართული ენით ახსენით რა არის ტერმინალი და რისთვის ვიყენებთ)

print(5 + 5)
#აქ ჩვენ შევკრიბეთ ორი მონაცემი

print('Giga' + ' '  + 'Kochalidze')
#აქ შევაერთე ორი ტექსტური მონაცემი

print(5 - 3)
# აქ გამოვაკელი ერთმანეთს ორი მონაცემი


#ტერმინალში გამოდის საბოლოო მონაცემი 



#შექმენით 2 ცვლადი, შეინახეთ მასში რიცხვები და საბოლოოდ დაბეჭდეთ ამ ორ ცვლადს შორის რომელიმე არითმეტიკული მოქმედება

num = 5
num1 = 10
print(num * num1)



#ახსენით კომენტარებით რა არის სტრინგი და რა არის მთელი რიცხვი

#სტრინგი არის ტექსტური მონაცემი და მთელი რიცხვი არის რიცხვები, მაგ: 1, 2, 13, 52 ...