// 1) შექმენით ფუნქცია, რომელიც გამოიტანს მესიჯს სამი წამის შემდეგ
let time = 1;

const t = setInterval(function(){
    time++
    console.log(time, 'Kochalidze');
    
}, 3000)


// 2) შექმენით პროგრამა, რომელიც ყოველ წამს გამოიტანს ამჟამინდელ დროს "საათი:წუთი:წამი"
setInterval(function(){
    const now = new Date();
    console.log(now.toUTCString());
}, 1000)


// 3) შექმენით პროგრამა, რომელიც ყოველ 3 წამში შეცვლის საიტის background ფონის ფერს.(ფერის მნიშვნელობა შეინახეთ მასივში)
// ფაილში გავაკეთე სახელად: index.html


// 4) დაწერეთ პროგრამა, რომელიც ყოველ 5 წამში შეცვლის საიტზე არსებული პარაგრაფის textContent-ს
// ფაილში გავაკეთე სახელად: index2.html


// 5) პროექტი:
// შექმენით პროგრამა ტაიმერი, რომელსაც გადასცემთ 3 ღილაკს Start,Pause,Reset
// ფაილში გავაკეთე სახელად: index3.html