#შექმენით ისეთი პროგრამა რომელიც 1დან 10მდე გამოითვლის ყველა რიცხვს for loop ის მეშვეობით და თითოეულ რიცხვს 1დან 10მდე დაამატებს სიაში. ციკლის შემდეგ კი გამოიყენეთ len ფუნქცია რატსაა გაიგოთ რამდენი ელემენტისგან შედგება ჩვენი სია

numbers = []

for i in range(1, 10):
    numbers.append(i)

print(numbers)
print(len(numbers))

# შექმენით ისეთ პროგრამა რომელიც მომხმარებელს შემოატანინებს 2 რიცხვს. შემოტანის შემდეგ for loop ის მეშვეობით გამოთვალეთ ყველა რიცხვი ამ ორ რიცხვს შორის და შემდეგ ისიდი ჩაამატეთ ლისტში საბოოლოოდ კი დაპრინტეთ ტერმინალში
num = int(input("plrase neter first number: "))
num1 = int(input("plrase neter second number: "))

for i in range(num, num1):
    print(i)

nums = []

for i in range(num, num1):
    nums.append(i)

print(nums)


#შექმენით პროგრამა სადაც მომხმარებელი შემოიტანს ორ რიცხვს საწყისი რიცხვი და ბოლო რიცხვი, გამოიანგარიშეთ ამ რიცხვებს შორის ყველა რიცხვი და დაამატეთ სიაში, საბოლოოდ დაბეჭდეთ ამ სიიდან მაქსიმალური, მინიმალური და ყველა რიცხვის ჯამის მნიშნელობები
start = int(input("enter start number: "))
last = int(input("enter last number: "))

all_numbers = []

for i in range(start, last):
    all_numbers.append(i)       

print(all_numbers)
print(min(all_numbers))
print(max(all_numbers))
print(sum(all_numbers))


#შექმენით პროგრამა სადაც მომხმარებელს შეეკითხებით რამდენი რიცხვის შემოტანა სურს შემდეგ კი for ციკლის მეშვეობით იმდენჯერ შემოატანინეთ რიცხვი რამდენიც მიუთითა ამის შემდეგ ეს რიცხვები დაამატეთ სიაში და საბოლოოდ გამოიტანეთ ამ რიცხვების ჯამი





# შექმენით სია სადაც შეიტანთ თქვენი საყვარელი მანქანების სახელებს მინიმუმ 5 ელემეტნი. გამოიყენეთ სლაისინგი რომ ჩამოაჭრათ 1) პირველი 3 ელემენტი და 2) ბოლო ორი ელემენტი საბოლოოდ კი დაბეჭდეთ ჩამოჭრილი სიები. ამის შემდეგ მინუსებიანი ინდექსებით გამოიტანეთ მარჯვნიდან მესამე და მეოთხე ელემენტები

cars = ["Mersedes", "BMW", "Rols Rois", "Bugat", "Subaru"]

print(cars[0:3])
print(cars[3:5])
print(cars[-1])
print(cars[-3])


# შექმენით სია სადაც გექნებათ თქვენი სახელი გამეორებული ორჯერ. როცა გადაუვლით სიას თუკი სახელი უდრის თქვენს სახელს დაწერეთ hello admin სხვა შემთხვევაში დაწერეთ hello user

name = ["Giga", "Giga"]

if name == name:
    print('hello admin')
else:
    print("hello user")

